# 1st Create Original Data

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Id': {0: 'a', 1: 'b', 2: 'c'},

                   'Height': {0: 188, 1: 173, 2: 175},

                   'Weight': {0: 82, 1: 74, 2: 66}})
df

  Id  Height  Weight
0  a     188      82
1  b     173      74
2  c     175      66

# 2nd Original -> melt

In [3]:
pd.melt(df, id_vars=["Id"], value_vars=["Height"])

  Id variable  value
0  a   Height    188
1  b   Height    173
2  c   Height    175

In [4]:
pd.melt(df, id_vars=["Id"], value_vars=["Height", "Weight"])

  Id variable  value
0  a   Height    188
1  b   Height    173
2  c   Height    175
3  a   Weight     82
4  b   Weight     74
5  c   Weight     66

In [5]:
df_melt = pd.melt(df, id_vars=["Id"], value_vars=["Height", "Weight"], var_name="Variable", value_name="Value")
df_melt

  Id Variable  Value
0  a   Height    188
1  b   Height    173
2  c   Height    175
3  a   Weight     82
4  b   Weight     74
5  c   Weight     66

In [6]:
pd.melt(df, id_vars=["Id"], value_vars=["Height", "Weight"], var_name="Variable", value_name="Value", ignore_index=False)

  Id Variable  Value
0  a   Height    188
1  b   Height    173
2  c   Height    175
0  a   Weight     82
1  b   Weight     74
2  c   Weight     66

# 3rd Original -> melt -> pivot -> Original

In [7]:
df_pivot = df_melt.pivot(index=["Id"], columns=["Variable"], values=["Value"])
df_pivot

          Value
Variable Height Weight
Id
a           188     82
b           173     74
c           175     66

In [8]:
df_pivot.index

Index(['a', 'b', 'c'], dtype='object', name='Id')

In [9]:
df_pivot.columns

MultiIndex([('Value', 'Height'),
            ('Value', 'Weight')],
           names=[None, 'Variable'])

In [10]:
df_pivot.columns = ["Height", "Weight"]
df_pivot

    Height  Weight
Id
a      188      82
b      173      74
c      175      66

In [11]:
df_pivot.reset_index()

  Id  Height  Weight
0  a     188      82
1  b     173      74
2  c     175      66

In [12]:
df

  Id  Height  Weight
0  a     188      82
1  b     173      74
2  c     175      66